1c/Catalogs/МИКО_аиОпросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МИКО_аиОпросы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетчикВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОпроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>questionId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>questionText</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>lang</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>questionId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>key</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>action</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>nextQuestion</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c/Catalogs/МИКО_аиОпросы/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
// Формируем структуру данных для отправки.
	Опрос = Новый Структура();
	Опрос.Вставить("crmId", Код);
	Опрос.Вставить("name",  Наименование);   
	Опрос.Вставить("questions", Новый Массив);   
	
	Для каждого Вопрос Из Вопросы Цикл
		Ответы = ВариантыОтветов.НайтиСтроки(Новый Структура("questionId", Вопрос.questionId)); 
		Если Ответы.Количество() = 0 Тогда
			Отказ = Истина;
			Сообщить("Для вопроса " + Вопрос.questionId + " не описаны варианты ответов.");
		КонецЕсли;	
		question = Новый Структура();    
		question.Вставить("questionId", 	Вопрос.questionId);
		question.Вставить("questionText", 	Вопрос.questionText);            
		Если ЗначениеЗаполнено(Вопрос.lang) Тогда
			question.Вставить("lang", 			Вопрос.lang);   
		КонецЕсли;
		question.Вставить("press", Новый Массив);
		Для каждого Ответ Из Ответы Цикл
			question.press.Добавить(Новый Структура("key,action,value,nextQuestion", Ответ.key, Ответ.action, Ответ.value, Ответ.nextQuestion));
		КонецЦикла;
		Опрос.questions.Добавить(question);  
	
	КонецЦикла;
	
	Результат = МИКО_аиAPI.СоздатьОпрос(Опрос);
	Отказ 		= (Результат.result = Ложь);
	Если Отказ Тогда
		Сообщить("Не вышло отправить задачу на сверер MikoPBX. Проверьте параметры подключения.");
	Иначе
		ИдентификаторОпроса = Результат.data.id;
	КонецЕсли;
КонецПроцедуры
